**Free

//====================================================
// Hello World in RPGLE
//====================================================

dsply 'Hello, World!'; // Display "Hello, World!" on the screen

*inlr = *on;  // Set the last record indicator to on to end the program